# MENGACAK URUTAN BARIS PADA DATAFRAME ##

### Import Modules ##

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame ###

In [3]:
n_rows = 6
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  3  4  2  1  4
1  4  1  2  2  4
2  3  1  3  3  1
3  2  3  2  3  4
4  2  3  1  2  2
5  3  1  2  1  4

### Mengacak Urutan Baris Pada DataFrame ##

In [4]:
df.sample(frac=1.0, random_state=1) #melakukan sampling penuh dan diacak berdasarkan random state tanpa mereset index

   A  B  C  D  E
2  3  1  3  3  1
1  4  1  2  2  4
4  2  3  1  2  2
0  3  4  2  1  4
3  2  3  2  3  4
5  3  1  2  1  4

In [5]:
df.sample(frac=1.0, random_state=1).reset_index(drop=True) #nilai index direset kembali sehingga diurutkan dari 0 -5

   A  B  C  D  E
0  3  1  3  3  1
1  4  1  2  2  4
2  2  3  1  2  2
3  3  4  2  1  4
4  2  3  2  3  4
5  3  1  2  1  4

2173004 Velinda Novelia Candra